In [1]:
import pandas as pd
import sqlite3

In [2]:
conn =  sqlite3.connect("../database/score.sqlite")

In [3]:
df = pd.read_sql_query("SELECT * FROM scores", conn)

In [4]:
df

   EM328  EM333  EM359  EM333:NILESHKUMAR PATEL  EM359:NINAD DIGHE
0  160.0  170.0  190.0                      170                190

In [5]:
df.drop(['EM328', 'EM333', 'EM359'], axis = 1, inplace =True)

In [8]:
df.to_sql('scores', conn, if_exists= 'replace', index = False)

/home/cmm/anaconda3/lib/python3.6/site-packages/pandas/core/generic.py:2127: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype)

In [9]:
conn.close()